#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ChrisWilding/terraform-github/runs/run-LsseJ2jwJ7Nq2694

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Initializing plugins and modules...
github_repository.www_chriswilding_dev: Refreshing state... [id=www.chriswilding.dev]
github_repository.nasa: Refreshing state... [id=nasa]
github_repository.advent_of_code_2019: Refreshing state... [id=advent-of-code-2019]
github_repository.advent_of_code_2021: Refreshing state... [id=advent-of-code-2021]
github_repository.exercism_go: Refreshing state... [id=exercism-go]
github_repository.exercism_rust: Refreshing state... [id=exercism-rust]
github_repository.bookshelf_api: Refreshing state... [id=bookshelf-api]
github_repository.exercism_typescript: Refreshing state... [id=exercism-typescript]
github_repository.curriculum_vitae: Refreshing state... [id=curriculum-vitae]
github_repository.bill: Refreshing state... [id=bill]
github_repository.mazes_for_programmers: Refreshing state... [id=mazes-for-programmers]
github_repository.merchants_guide_to_the_galaxy: Refreshing state... [id=merchants-guide-to-the-galaxy]
github_repository.sahi: Refreshing state... [id=sahi]
github_repository.exercism_c: Refreshing state... [id=exercism-c]
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_repository.hotels: Refreshing state... [id=hotels]
github_repository.nand2tetris: Refreshing state... [id=nand2tetris]
github_repository.fsa: Refreshing state... [id=fsa]
github_repository.exercism_ocaml: Refreshing state... [id=exercism-ocaml]
github_repository.terraform_aws_secrets: Refreshing state... [id=terraform-aws-secrets]
github_repository.discography_api: Refreshing state... [id=discography-api]
github_repository.spring_microservices_in_action: Refreshing state... [id=spring-microservices-in-action]
github_repository.monkey: Refreshing state... [id=monkey]
github_repository.terraform_aws: Refreshing state... [id=terraform-aws]
github_repository.advent_of_code_2017: Refreshing state... [id=advent-of-code-2017]
github_repository.exercism_erlang: Refreshing state... [id=exercism-erlang]
github_repository.pact_broker_secrets: Refreshing state... [id=pact-broker-secrets]
github_repository.exercism_elixir: Refreshing state... [id=exercism-elixir]
github_repository.go_base: Refreshing state... [id=go-base]
github_repository.ginventory: Refreshing state... [id=ginventory]
github_repository.exercism_scala: Refreshing state... [id=exercism-scala]
github_repository.tiger_ocaml: Refreshing state... [id=tiger-ocaml]
github_repository.exercism_kotlin: Refreshing state... [id=exercism-kotlin]
github_repository.terraform_github: Refreshing state... [id=terraform-github]
github_repository.experiment_autotag: Refreshing state... [id=experiment-autotag]
github_repository.magidash: Refreshing state... [id=magidash]
github_repository.experiment_aurora_lambda: Refreshing state... [id=experiment-aurora-lambda]
github_repository.jinventory: Refreshing state... [id=jinventory]
github_repository.jlox: Refreshing state... [id=jlox]
github_repository.exercism_mips: Refreshing state... [id=exercism-mips]
github_repository.canvas: Refreshing state... [id=canvas]
github_repository.experiment_io_ts: Refreshing state... [id=experiment-io-ts]
github_repository.bump: Refreshing state... [id=bump]
github_repository.exercism_x86_64_assembly: Refreshing state... [id=exercism-x86-64-assembly]
github_repository.tiger_go: Refreshing state... [id=tiger-go]
github_repository.pact_broker: Refreshing state... [id=pact-broker]
github_repository.aws_nuke: Refreshing state... [id=aws-nuke]
github_repository.advent_of_code_2018: Refreshing state... [id=advent-of-code-2018]
github_repository.advent_of_code_2020: Refreshing state... [id=advent-of-code-2020]
github_repository.exercism_java: Refreshing state... [id=exercism-java]
github_repository.experiment_kafka: Refreshing state... [id=experiment-kafka]
github_repository.to_roman_numeral: Refreshing state... [id=to-roman-numeral]
github_repository.clox: Refreshing state... [id=clox]
github_repository.organisation_accounts_client: Refreshing state... [id=organisation-accounts-client]
github_repository.crawl: Refreshing state... [id=crawl]
github_branch_protection.mazes_for_programmers: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE2NjcxMzE=]
github_actions_secret.go_base_terraform_cloud_api_key: Refreshing state... [id=go-base:TERRAFORM_CLOUD_API_KEY]
github_actions_secret.go_base_heroku_api_key: Refreshing state... [id=go-base:HEROKU_API_KEY]
github_branch_protection.go_base: Refreshing state... [id=BPR_kwDOG6o6fs4BdUt4]
github_actions_secret.terraform_cloud_api_key: Refreshing state... [id=terraform-github:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.terraform_github: Refreshing state... [id=BPR_kwDOFtzSP84BciXm]
github_actions_secret.magidash_heroku_api_key: Refreshing state... [id=magidash:HEROKU_API_KEY]
github_actions_secret.heroku_api_key: Refreshing state... [id=jinventory:HEROKU_API_KEY]
github_branch_protection.jinventory: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3NDU0ODk=]
github_actions_secret.aws_secret_access_key: Refreshing state... [id=aws-nuke:AWS_SECRET_ACCESS_KEY]
github_actions_secret.aws_access_key_id: Refreshing state... [id=aws-nuke:AWS_ACCESS_KEY_ID]
github_branch_protection.organisation_accounts_client: Refreshing state... [id=BPR_kwDOG_uO484Bf4-u]
github_branch_protection.crawl: Refreshing state... [id=BPR_kwDOG9mVlc4BdzBc]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.dotfiles has changed
  ~ resource "github_repository" "dotfiles" {
      ~ etag                   = "W/\"1c28482042c26d09eef0dfb8e2d3cd1a20ddddd31a607cc48d78cd7226f9c8c8\"" -> "W/\"8eb289198369c0db41f82e8b542afcbb044cd0904637b9059ff3e11f116ce7e1\""
      ~ full_name              = "ChrisWilding/dotfiles" -> "chriswilding/dotfiles"
      ~ git_clone_url          = "git://github.com/ChrisWilding/dotfiles.git" -> "git://github.com/chriswilding/dotfiles.git"
      ~ html_url               = "https://github.com/ChrisWilding/dotfiles" -> "https://github.com/chriswilding/dotfiles"
      ~ http_clone_url         = "https://github.com/ChrisWilding/dotfiles.git" -> "https://github.com/chriswilding/dotfiles.git"
        id                     = "dotfiles"
        name                   = "dotfiles"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/dotfiles.git" -> "git@github.com:chriswilding/dotfiles.git"
      ~ svn_url                = "https://github.com/ChrisWilding/dotfiles" -> "https://github.com/chriswilding/dotfiles"
        # (21 unchanged attributes hidden)
    }

  # github_repository.exercism_rust has changed
  ~ resource "github_repository" "exercism_rust" {
      ~ etag                   = "W/\"f22df644c67f93846724cf0cf67e4e1c85a8c8a49a2c8c6e0967346139bf6d1c\"" -> "W/\"ef4196c44c4418a207f1ce7827c025c3ef3e41a9f7f732331a6f45b1927ecb53\""
      ~ full_name              = "ChrisWilding/exercism-rust" -> "chriswilding/exercism-rust"
      ~ git_clone_url          = "git://github.com/ChrisWilding/exercism-rust.git" -> "git://github.com/chriswilding/exercism-rust.git"
      ~ html_url               = "https://github.com/ChrisWilding/exercism-rust" -> "https://github.com/chriswilding/exercism-rust"
      ~ http_clone_url         = "https://github.com/ChrisWilding/exercism-rust.git" -> "https://github.com/chriswilding/exercism-rust.git"
        id                     = "exercism-rust"
        name                   = "exercism-rust"
      ~ ssh_clone_url          = "git@github.com:ChrisWilding/exercism-rust.git" -> "git@github.com:chriswilding/exercism-rust.git"
      ~ svn_url                = "https://github.com/ChrisWilding/exercism-rust" -> "https://github.com/chriswilding/exercism-rust"
        # (24 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.dlog will be created
  + resource "github_repository" "dlog" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + license_template       = "apache-2.0"
      + name                   = "dlog"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @chriswilding, Action: `pull_request`*